cf/Documents/ДопРасходИнтернетМагазина.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ДопРасходИнтернетМагазина</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДопРасходыИнтернетМагазина</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Периодический</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Отдел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статья</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДДСБух</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Documents/ДопРасходИнтернетМагазина/Ext/ManagerModule.bsl
Процедура ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
	
	
	Запрос = Новый Запрос(
			 
	КэшируемыеФункции.ТектЗапросаПолученияПараметровСистемы() + "
	|;
		
	// ОПЛАТА ПО ИМПОРТУ
		
	|ВЫБРАТЬ
	|	&Период				Период,
	|	Отдел				Отдел,	
	|	Статья 				СтатьяРасхода,
	|	Валюта 				Валюта,
	|   Сумма
	|ИЗ
	|	Документ.ДопРасходИнтернетМагазина.Расходы
	|ГДЕ
	|	Ссылка = &Ссылка
	//|;
	//|ВЫБРАТЬ
	//|	&Период								КАК Период,
	////|	Док.БанковскийСчетОрганизации	КАК КассаСчет,
	//|	Статья							КАК СтатьяДДС,
	//|	Отдел,
	//|	- Сумма						  	КАК	Сумма 
	//|                          
	//|ИЗ
	//|	Документ.ДопРасходИнтернетМагазина.Расходы 
	//|ГДЕ
	//|	Ссылка = &Ссылка
	|");
	
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", Ссылка.Дата);
	
	Пакет = Запрос.ВыполнитьПакет();
	
	ДополнительныеСвойства.Вставить("ПараметрыСистемы", КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[0].Выгрузить()));
	ДополнительныеСвойства.Вставить("ДопРасходыИнтернетМагазина", 	Пакет[1].Выгрузить());
	
	Если Ссылка.Периодический Тогда
		текДата = Ссылка.Дата;
		ДатаОкончания = Ссылка.ДатаОкончания; Если Не ЗначениеЗаполнено(ДатаОкончания) Тогда ДатаОкончания = ДобавитьМесяц(текДата, 240) КонецЕсли;
		Период = Ссылка.Период;
		
		ПакетПериодический = Пакет[1].Выгрузить();
		
		Пока текДата < ДатаОкончания Цикл
			// 0 - Месяц
			// 1 - Год
			// 2 - Неделя
			// 3 - День
			Если Период = 0 Тогда
				текДата = ДобавитьМесяц(текДата, 1);
			ИначеЕсли Период = 1 Тогда
				текДата = ДобавитьМесяц(текДата, 12);
			ИначеЕсли Период = 2 Тогда
				текДата = текДата + 604800;
			ИначеЕсли Период = 3 Тогда
				текДата = текДата + 86400;
			КонецЕсли;
			Для каждого лСтрока Из ПакетПериодический Цикл
				новСтрока = ДополнительныеСвойства.ДопРасходыИнтернетМагазина.Добавить();
				ЗаполнитьЗначенияСвойств(новСтрока, лСтрока);
				новСтрока.Период = текДата;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
                     
КонецПроцедуры
